#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_ami.ecs_ami: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e1d0243d02de04e0]
module.ecs.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-prod]
aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.autoscaling.data.aws_default_tags.current: Reading...
aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.autoscaling.data.aws_partition.current: Reading...
module.ecs.module.cluster.data.aws_partition.current: Reading...
aws_cloudwatch_log_group.django-log-group: Refreshing state... [id=/ecs/django-app]
data.aws_availability_zones.aws_azs: Reading...
module.autoscaling.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.autoscaling.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
data.aws_availability_zones.aws_azs: Read complete after 0s [id=eu-west-1]
aws_cloudwatch_log_stream.django-log-stream: Refreshing state... [id=django-app-log-stream]
module.ecs.module.cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:954050840447:cluster/django-prod]
data.aws_ami.ecs_ami: Read complete after 1s [id=ami-098220853f4644225]
module.autoscaling.aws_launch_template.this[0]: Refreshing state... [id=lt-05aebd499e3077330]
module.alb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-032cfc42b7478e925]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08a301e7900ff17ef]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09db5785a6dfd071c]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e39f2ae61401b1c4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac9304bc66da227f]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a2558af275291418]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f096da4f7714fcf7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06f8c93e4a685e1ab]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-083ae407345a775e5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-077f4e93189de9d4e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e8fc1e1647b7df17]
module.alb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-441417626]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-86115656]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3522305327]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3552822451]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[3]: Refreshing state... [id=sgrule-2473780471]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-1143663398]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a477dbbde07c0098]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06f8c93e4a685e1ab1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2708099d9838709]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e0b862f487d38fd]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a92982e3e98f3ad6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08068361a78700ab1]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d2d71fa8544ec8c]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:loadbalancer/app/django-elb/3d0916a3c7717f9e]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f096da4f7714fcf71080289494]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:listener/app/django-elb/3d0916a3c7717f9e/3713d42335b643a3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.autoscaling.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = (known after apply)
      + name_prefix                      = "django_ecs_auto_scaling_group-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe",
        ]
      + termination_policies             = []
      + vpc_zone_identifier              = [
          + "subnet-083ae407345a775e5",
          + "subnet-0a2558af275291418",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = "django-ecs-cluster-lt-20231012142657888400000001"
          + version = "1"
        }

      + tag {
          + key                 = "ManagedBy"
          + propagate_at_launch = true
          + value               = "Terraform"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "django_ecs_auto_scaling_group"
        }

      + timeouts {}
    }

  # module.ecs.module.cluster.aws_ecs_capacity_provider.this["on-demand"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "on-demand"
      + tags     = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all = {
          + "ManagedBy" = "Terraform"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 1
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 1
            }
        }
    }

  # module.ecs.module.cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "on-demand",
        ]
      + cluster_name       = "django-prod"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "on-demand"
          + weight            = 100
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @phil-ward, Action: `pull_request`, Working Directory: ``, Workflow: `ci`*